
# Constraints
# ----------------------------------------------------------------------------
#
# 1. Master Clock Definitions
#
# 2. Generated Clock Definitions
#
# 3. Clock Uncertainties
#
# 4. Clock Latencies 
#
# 5. Clock Relationships
#
# 6. set input/output delay on ports
#
# 7. Driving cells
#
# 8. Output load

####################################################################################
           #########################################################
                  #### Section 1 : Clock Definition ####
           #########################################################
#################################################################################### 
# 1. Master Clock Definitions 
# 2. Generated Clock Definitions
# 3. Clock Latencies
# 4. Clock Uncertainties
# 4. Clock Transitions
####################################################################################

set CLK_NAME REF_CLK
set CLK_PER 20
set CLK_SETUP_SKEW 0.2
set CLK_HOLD_SKEW 0.1
set CLK_LAT 0
set CLK_RISE 0.05
set CLK_FALL 0.05

set CLK_NAME_2 UART_CLK
set CLK_PER_2 271.267
set RX_PERIOD $CLK_PER_2
set TX_PERIOD [expr $CLK_PER_2 * 32]
set ALU_PERIOD $CLK_PER

## Master Clocks
create_clock -name $CLK_NAME -period $CLK_PER -waveform "0 [expr $CLK_PER/2.0]" [get_ports REF_CLK]
set_clock_uncertainty -setup $CLK_SETUP_SKEW [get_clocks $CLK_NAME]
set_clock_uncertainty -hold $CLK_HOLD_SKEW  [get_clocks $CLK_NAME]
set_clock_transition -rise $CLK_RISE  [get_clocks $CLK_NAME]
set_clock_transition -fall $CLK_FALL  [get_clocks $CLK_NAME]
set_clock_latency $CLK_LAT [get_clocks $CLK_NAME]
set_dont_touch_network "$CLK_NAME"


create_clock -name $CLK_NAME_2 -period $CLK_PER_2 -waveform "0 [expr $CLK_PER_2/2.0]" [get_ports UART_CLK]
set_clock_uncertainty -setup $CLK_SETUP_SKEW [get_clocks $CLK_NAME_2]
set_clock_uncertainty -hold $CLK_HOLD_SKEW  [get_clocks $CLK_NAME_2]
set_clock_transition -rise $CLK_RISE  [get_clocks $CLK_NAME_2]
set_clock_transition -fall $CLK_FALL  [get_clocks $CLK_NAME_2]
set_clock_latency $CLK_LAT [get_clocks $CLK_NAME_2]
set_dont_touch_network "$CLK_NAME_2"

## Generated clocks

create_generated_clock -master_clock $CLK_NAME -source [get_ports REF_CLK] \
                       -name "ALU_Gated_CLK" [get_port alu_inst/CLK] \
                       -divide_by 1
set_dont_touch_network "ALU_Gated_CLK"

create_generated_clock -master_clock $CLK_NAME_2 -source [get_ports UART_CLK] \
                       -name "RX_CLK" [get_port uart_inst/RX_CLK] \
                       -divide_by 1
set_dont_touch_network "RX_CLK"

create_generated_clock -master_clock $CLK_NAME_2 -source [get_ports UART_CLK] \
                       -name "TX_CLK" [get_port uart_inst/TX_CLK] \
                       -divide_by 32
set_dont_touch_network "TX_CLK"
set_clock_uncertainty -setup $CLK_SETUP_SKEW [get_clocks ALU_Gated_CLK]
set_clock_uncertainty -hold $CLK_HOLD_SKEW  [get_clocks ALU_Gated_CLK]

set_clock_uncertainty -setup $CLK_SETUP_SKEW [get_clocks RX_CLK]
set_clock_uncertainty -hold $CLK_HOLD_SKEW  [get_clocks RX_CLK]

set_clock_uncertainty -setup $CLK_SETUP_SKEW [get_clocks TX_CLK]
set_clock_uncertainty -hold $CLK_HOLD_SKEW  [get_clocks TX_CLK]
		 
					  

####################################################################################
           #########################################################
                  #### Section 2 : Clocks Relationships ####
           #########################################################
####################################################################################
# Define asynchronous clock groups (no timing relation between them)
set_clock_groups -asynchronous -group [get_clocks "$CLK_NAME ALU_Gated_CLK"] \
                               -group [get_clocks "$CLK_NAME_2 RX_CLK TX_CLK"]

####################################################################################
           #########################################################
             #### Section 3 : set input/output delay on ports ####
           #########################################################
####################################################################################

set in_delay  [expr 0.2*$CLK_PER_2]
set out_delay [expr 0.2*$CLK_PER_2]




#Constrain Input Paths
set_input_delay $in_delay -clock $CLK_NAME_2 [get_port UART_RX_IN]

#Constrain Output Paths
set_output_delay $out_delay -clock  TX_CLK [get_port UART_TX_O]
set_output_delay $out_delay -clock  $CLK_NAME_2 [get_port framing_error]
set_output_delay $out_delay -clock  $CLK_NAME_2 [get_port parity_error]




####################################################################################
           #########################################################
                  #### Section 4 : Driving cells ####
           #########################################################
####################################################################################
set_driving_cell -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -lib_cell BUFX2M -pin Y [get_port UART_RX_IN]

####################################################################################
           #########################################################
                  #### Section 5 : Output load ####
           #########################################################
####################################################################################
set_load 0.1  [get_port UART_TX_O]
set_load 0.1  [get_port parity_error]
set_load 0.1  [get_port framing_error]


####################################################################################
           #########################################################
                 #### Section 6 : Operating Condition ####
           #########################################################
####################################################################################

# Define the Worst Library for Max(#setup) analysis
# Define the Best Library for Min(hold) analysis
set_operating_conditions -min_library "scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c" -min "scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c" -max_library "scmetro_tsmc_cl013g_rvt_ss_1p08v_125c" -max "scmetro_tsmc_cl013g_rvt_ss_1p08v_125c"

####################################################################################
           #########################################################
                  #### Section 7 : wireload Model ####
           #########################################################
####################################################################################


####################################################################################
           #########################################################
                  #### Section 8 : multicycle path ####
           #########################################################
####################################################################################


